Oryx-Embedded/CycloneTCP/drivers/mac/mimxrt1170_eth3_driver.c
/**
 * @file mimxrt1170_eth3_driver.c
 * @brief NXP i.MX RT1170 Gigabit Ethernet MAC driver (ENET_QOS instance)
 *
 * @section License
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 *
 * Copyright (C) 2010-2026 Oryx Embedded SARL. All rights reserved.
 *
 * This file is part of CycloneTCP Open.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software Foundation,
 * Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
 *
 * @author Oryx Embedded SARL (www.oryx-embedded.com)
 * @version 2.6.2
 **/

//Switch to the appropriate trace level
#define TRACE_LEVEL NIC_TRACE_LEVEL

//Dependencies
#include "fsl_device_registers.h"
#include "fsl_gpio.h"
#include "fsl_iomuxc.h"
#include "core/net.h"
#include "drivers/mac/mimxrt1170_eth3_driver.h"
#include "debug.h"

//Underlying network interface
static NetInterface *nicDriverInterface;

//IAR EWARM compiler?
#if defined(__ICCARM__)

//Transmit buffer
#pragma data_alignment = 4
#pragma location = MIMXRT1170_ETH3_RAM_SECTION
static uint8_t txBuffer[MIMXRT1170_ETH3_TX_BUFFER_COUNT][MIMXRT1170_ETH3_TX_BUFFER_SIZE];
//Receive buffer
#pragma data_alignment = 4
#pragma location = MIMXRT1170_ETH3_RAM_SECTION
static uint8_t rxBuffer[MIMXRT1170_ETH3_RX_BUFFER_COUNT][MIMXRT1170_ETH3_RX_BUFFER_SIZE];
//Transmit DMA descriptors
#pragma data_alignment = 8
#pragma location = MIMXRT1170_ETH3_RAM_SECTION
static Mimxrt1170Eth3TxDmaDesc txDmaDesc[MIMXRT1170_ETH3_TX_BUFFER_COUNT];
//Receive DMA descriptors
#pragma data_alignment = 8
#pragma location = MIMXRT1170_ETH3_RAM_SECTION
static Mimxrt1170Eth3RxDmaDesc rxDmaDesc[MIMXRT1170_ETH3_RX_BUFFER_COUNT];

//Keil MDK-ARM or GCC compiler?
#else

//Transmit buffer
static uint8_t txBuffer[MIMXRT1170_ETH3_TX_BUFFER_COUNT][MIMXRT1170_ETH3_TX_BUFFER_SIZE]
   __attribute__((aligned(4), __section__(MIMXRT1170_ETH3_RAM_SECTION)));
//Receive buffer
static uint8_t rxBuffer[MIMXRT1170_ETH3_RX_BUFFER_COUNT][MIMXRT1170_ETH3_RX_BUFFER_SIZE]
   __attribute__((aligned(4), __section__(MIMXRT1170_ETH3_RAM_SECTION)));
//Transmit DMA descriptors
static Mimxrt1170Eth3TxDmaDesc txDmaDesc[MIMXRT1170_ETH3_TX_BUFFER_COUNT]
   __attribute__((aligned(8), __section__(MIMXRT1170_ETH3_RAM_SECTION)));
//Receive DMA descriptors
static Mimxrt1170Eth3RxDmaDesc rxDmaDesc[MIMXRT1170_ETH3_RX_BUFFER_COUNT]
   __attribute__((aligned(8), __section__(MIMXRT1170_ETH3_RAM_SECTION)));

#endif

//Current transmit descriptor
static uint_t txIndex;
//Current receive descriptor
static uint_t rxIndex;


/**
 * @brief i.MX RT1170 Ethernet MAC driver (ENET_QOS instance)
 **/

const NicDriver mimxrt1170Eth3Driver =
{
   NIC_TYPE_ETHERNET,
   ETH_MTU,
   mimxrt1170Eth3Init,
   mimxrt1170Eth3Tick,
   mimxrt1170Eth3EnableIrq,
   mimxrt1170Eth3DisableIrq,
   mimxrt1170Eth3EventHandler,
   mimxrt1170Eth3SendPacket,
   mimxrt1170Eth3UpdateMacAddrFilter,
   mimxrt1170Eth3UpdateMacConfig,
   mimxrt1170Eth3WritePhyReg,
   mimxrt1170Eth3ReadPhyReg,
   TRUE,
   TRUE,
   TRUE,
   FALSE
};


/**
 * @brief i.MX RT1170 Ethernet MAC initialization
 * @param[in] interface Underlying network interface
 * @return Error code
 **/

error_t mimxrt1170Eth3Init(NetInterface *interface)
{
   error_t error;
   uint32_t temp;

   //Debug message
   TRACE_INFO("Initializing i.MX RT1170 Ethernet MAC (ENET_QOS)...\r\n");

   //Save underlying network interface
   nicDriverInterface = interface;

   //Enable ENET_QOS peripheral clock
   CLOCK_EnableClock(kCLOCK_Enet_Qos);

   //GPIO configuration
   mimxrt1170Eth3InitGpio(interface);

   //Perform a software reset
   ENET_QOS->DMA_MODE |= ENET_QOS_DMA_MODE_SWR_MASK;
   //Wait for the reset to complete
   while((ENET_QOS->DMA_MODE & ENET_QOS_DMA_MODE_SWR_MASK) != 0)
   {
   }

   //Adjust MDC clock range depending on CSR frequency
   ENET_QOS->MAC_MDIO_ADDRESS = ENET_QOS_MAC_MDIO_ADDRESS_CR(7);

   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Ethernet PHY initialization
      error = interface->phyDriver->init(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Ethernet switch initialization
      error = interface->switchDriver->init(interface);
   }
   else
   {
      //The interface is not properly configured
      error = ERROR_FAILURE;
   }

   //Any error to report?
   if(error)
   {
      return error;
   }

   //Use default MAC configuration
   ENET_QOS->MAC_CONFIGURATION = ENET_QOS_MAC_CONFIGURATION_GPSLCE_MASK |
      ENET_QOS_MAC_CONFIGURATION_DO_MASK;

   //Set the maximum packet size that can be accepted
   temp = ENET_QOS->MAC_EXT_CONFIGURATION & ~ENET_QOS_MAC_EXT_CONFIGURATION_GPSL_MASK;
   ENET_QOS->MAC_EXT_CONFIGURATION = temp | MIMXRT1170_ETH3_RX_BUFFER_SIZE;

   //Configure MAC address filtering
   mimxrt1170Eth3UpdateMacAddrFilter(interface);

   //Disable flow control
   ENET_QOS->MAC_TX_FLOW_CTRL_Q[0] = 0;
   ENET_QOS->MAC_RX_FLOW_CTRL = 0;

   //Enable the first RX queue
   ENET_QOS->MAC_RXQ_CTRL[0] = ENET_QOS_MAC_RXQ_CTRL_RXQ0EN(2);

   //Configure DMA operating mode
   ENET_QOS->DMA_MODE = ENET_QOS_DMA_MODE_INTM(0) | ENET_QOS_DMA_MODE_DSPW(0);
   //Configure system bus mode
   ENET_QOS->DMA_SYSBUS_MODE |= ENET_QOS_DMA_SYSBUS_MODE_AAL_MASK;

   //The DMA takes the descriptor table as contiguous
   ENET_QOS->DMA_CH[0].DMA_CHX_CTRL = ENET_QOS_DMA_CHX_CTRL_DSL(0);
   //Configure TX features
   ENET_QOS->DMA_CH[0].DMA_CHX_TX_CTRL = ENET_QOS_DMA_CHX_TX_CTRL_TxPBL(32);

   //Configure RX features
   ENET_QOS->DMA_CH[0].DMA_CHX_RX_CTRL = ENET_QOS_DMA_CHX_RX_CTRL_RxPBL(32) |
      ENET_QOS_DMA_CHX_RX_CTRL_RBSZ_13_y(MIMXRT1170_ETH3_RX_BUFFER_SIZE / 8);

   //Enable store and forward mode for transmission
   ENET_QOS->MTL_QUEUE[0].MTL_TXQX_OP_MODE |= ENET_QOS_MTL_TXQX_OP_MODE_TQS(7) |
      ENET_QOS_MTL_TXQX_OP_MODE_TXQEN(2) | ENET_QOS_MTL_TXQX_OP_MODE_TSF_MASK;

   //Enable store and forward mode for reception
   ENET_QOS->MTL_QUEUE[0].MTL_RXQX_OP_MODE |= ENET_QOS_MTL_RXQX_OP_MODE_RQS(7) |
      ENET_QOS_MTL_RXQX_OP_MODE_RSF_MASK;

   //Initialize DMA descriptor lists
   mimxrt1170Eth3InitDmaDesc(interface);

   //Prevent interrupts from being generated when statistic counters reach
   //half their maximum value
   ENET_QOS->MAC_MMC_TX_INTERRUPT_MASK = 0xFFFFFFFF;
   ENET_QOS->MAC_MMC_RX_INTERRUPT_MASK = 0xFFFFFFFF;
   ENET_QOS->MAC_MMC_IPC_RX_INTERRUPT_MASK = 0xFFFFFFFF;
   ENET_QOS->MAC_MMC_FPE_TX_INTERRUPT_MASK = 0xFFFFFFFF;
   ENET_QOS->MAC_MMC_FPE_RX_INTERRUPT_MASK = 0xFFFFFFFF;

